{
    "_class_name": "AutoencoderKL",
    "_diffusers_version": "0.6.0",
    "act_fn": "silu",
    "block_out_channels": [
      128,
      256,
      512,
      512
    ],
    "down_block_types": [
      "DownEncoderBlock2D",
      "DownEncoderBlock2D",
      "DownEncoderBlock2D",
      "DownEncoderBlock2D"
    ],
    "in_channels": 1,
    "latent_channels": 16,
    "layers_per_block": 2,
    "norm_num_groups": 32,
    "out_channels": 1,
    "sample_size": 512,
    "up_block_types": [
      "UpDecoderBlock2D",
      "UpDecoderBlock2D",
      "UpDecoderBlock2D",
      "UpDecoderBlock2D"
    ]
  }